Repository: carolinabencosme/movil-final
Catalog: lib/l10n/app_*.arb
Languages: es

# homeQuickAccessGymLeaders
source: Gym Leaders & Elite 4
es: Líderes de Gimnasio y Alto Mando

# homeQuickAccessNatures
source: Natures
es: Naturalezas

# homeQuickAccessMatchups
source: Type Matchups
es: Enfrentamientos de tipos

# homeQuickAccessEvolutionChains
source: Evolution Chains
es: Cadenas evolutivas

# homeQuickAccessBreeding
source: Breeding Guides
es: Guías de crianza

# homeQuickAccessBerries
source: Berry Farming
es: Cultivo de bayas

# authLoginTitle
source: Welcome back
es: Bienvenido de nuevo

# authLoginSubtitle
source: Sign in with your email to access your Pokédex.
es: Inicia sesión con tu correo electrónico para acceder a tu Pokédex.

# authEmailLabel
source: Email
es: Correo electrónico

# authPasswordLabel
source: Password
es: Contraseña

# authLoginButton
source: Sign in
es: Iniciar sesión

# authNoAccountCta
source: Don't have an account? Sign up
es: ¿No tienes cuenta? Regístrate

# authLoginError
source: We couldn't sign you in. Try again.
es: No fue posible iniciar sesión. Inténtalo de nuevo.

# authEmailRequired
source: Enter your email.
es: Ingresa tu correo electrónico.

# authEmailInvalid
source: Invalid email format.
es: Formato de correo inválido.

# authPasswordRequired
source: Enter your password.
es: Ingresa tu contraseña.

# authPasswordLength
source: The password must contain at least 6 characters.
es: La contraseña debe tener al menos 6 caracteres.

# authRegisterTitle
source: Create your account
es: Crea tu cuenta

# authRegisterSubtitle
source: Register to sync your teams and collections across all your devices.
es: Regístrate para sincronizar tus equipos y colecciones en todos tus dispositivos.

# authCreateAccountButton
source: Create account
es: Crear cuenta

# authAlreadyHaveAccountCta
source: Already have an account? Sign in
es: ¿Ya tienes una cuenta? Inicia sesión

# authRegisterError
source: We couldn't create your account. Try again later.
es: No pudimos crear tu cuenta. Inténtalo más tarde.

# authSecurePasswordRequired
source: Enter a secure password.
es: Ingresa una contraseña segura.

# authPasswordStrongSuggestion
source: Use letters and numbers for a stronger password.
es: Usa letras y números para una contraseña más fuerte.

# authConfirmPasswordLabel
source: Confirm password
es: Confirmar contraseña

# authPasswordsMismatch
source: Passwords do not match.
es: Las contraseñas no coinciden.

# authSnackbarNoUser
source: User information is not available.
es: No hay información de usuario disponible.

# authProfileUpdated
source: Profile updated successfully.
es: Perfil actualizado correctamente.

# authProfileUpdateError
source: We couldn't update the profile.
es: No fue posible actualizar el perfil.

# authUpdateInfoTitle
source: Update your login information.
es: Actualiza tu información de acceso.

# authUpdateInfoSubtitle
source: Change your email address or set a new password. Changes apply immediately.
es: Puedes cambiar tu correo electrónico o establecer una nueva contraseña. Los cambios se aplican inmediatamente.

# authNewPasswordOptionalLabel
source: New password (optional)
es: Nueva contraseña (opcional)

# settingsTitle
source: Settings
es: Configuración

# settingsAccountSection
source: Account
es: Cuenta

# settingsNoEmail
source: No email on record
es: Sin correo registrado

# settingsEditProfile
source: Edit profile
es: Editar perfil

# settingsSignOut
source: Sign out
es: Cerrar sesión

# settingsAppearanceSection
source: Appearance
es: Apariencia

# settingsLanguageSection
source: Language
es: Idioma

# settingsLanguageLabel
source: App language
es: Idioma de la app

# settingsLanguageEnglish
source: English
es: Inglés

# settingsLanguageSpanish
source: Spanish
es: Español

# settingsLightModeTitle
source: Light mode
es: Modo claro

# settingsLightModeSubtitle
source: Bright backgrounds for well-lit environments.
es: Fondos luminosos ideales para entornos bien iluminados.

# settingsDarkModeTitle
source: Dark mode
es: Modo oscuro

# settingsDarkModeSubtitle
source: Dim the lights to reduce eye strain at night.
es: Atenúa la luz para reducir el cansancio visual por la noche.

# settingsInfo
source: Settings save immediately and affect the entire app.
es: La configuración se guarda inmediatamente y afecta a toda la aplicación.

# settingsSaveChanges
source: Save changes
es: Guardar cambios

# favoritesDefaultTitle
source: Favorites
es: Favoritos

# favoritesEmptyTitle
source: You don't have favorite Pokémon yet.
es: Aún no tienes Pokémon favoritos.

# favoritesEmptySubtitle
source: Explore the Pokédex and tap the heart to save your favorites.
es: Explora la Pokédex y marca con el corazón los Pokémon que quieras guardar.

# homeQuickAccessTitle
source: Quick access
es: Accesos rápidos

# homeSectionPokedexSubtitle
source: National index & regional dexes
es: Índice nacional y pokédex regionales

# homeSectionFavoritesTitle
source: Favorites
es: Favoritos

# homeSectionFavoritesSubtitle
source: Your saved Pokémon
es: Tus Pokémon guardados

# homeSectionTriviaTitle
source: Trivia
es: Curiosidades

# homeSectionTriviaSubtitle
source: Fun facts & lore highlights
es: Datos curiosos y lore destacado

# homeSectionMovesTitle
source: Moves
es: Movimientos

# homeSectionMovesSubtitle
source: Damage, effects & contest data
es: Daño, efectos y datos de concursos

# homeSectionTmTitle
source: TM
es: MT

# homeSectionTmSubtitle
source: Machines & tutors by generation
es: Máquinas y tutores por generación

# homeSectionAbilitiesTitle
source: Abilities
es: Habilidades

# homeSectionAbilitiesSubtitle
source: Passive effects & triggers
es: Efectos pasivos y activadores

# homeSectionChecklistsTitle
source: Checklists
es: Listas de control

# homeSectionChecklistsSubtitle
source: Track goals & collections
es: Sigue metas y colecciones

# homeSectionPartiesTitle
source: Parties
es: Equipos

# homeSectionPartiesSubtitle
source: Build teams & strategies
es: Arma equipos y estrategias

# homeSectionLocationsTitle
source: Locations
es: Ubicaciones

# homeSectionLocationsSubtitle
source: Regions, maps & encounter data
es: Regiones, mapas y datos de encuentros

# triviaTitle
source: Trivia
es: Curiosidades

# triviaDescription
source: Discover fun facts about Pokémon.
es: Descubre datos curiosos sobre Pokémon.

# triviaPlayCardTitle
source: Play Pokémon trivia
es: Jugar trivia Pokémon

# triviaPlayCardSubtitle
source: Test your knowledge with silhouettes and quick clues.
es: Pon a prueba tus conocimientos con siluetas y pistas rápidas.

# triviaRankingCardTitle
source: View Top 10 ranking
es: Ver ranking Top 10

# triviaRankingCardSubtitle
source: Check high scores and get motivated to beat the board.
es: Consulta las mejores puntuaciones y motívate a superar el marcador.

# triviaAchievementsCardTitle
source: Unlocked achievements
es: Logros desbloqueados

# triviaAchievementsCardSubtitle
source: Review the badges you've earned during trivia sessions.
es: Revisa las insignias que has ganado durante tus sesiones de trivia.

# triviaAchievementsTitle
source: Trivia achievements
es: Logros de trivia

# triviaAchievementsEmpty
source: No achievements available yet.
es: Aún no hay logros disponibles.

# triviaAchievementsLockedLabel
source: Locked
es: Pendiente

# triviaAchievementsUnlockedLabel
source: Unlocked · {date}
es: Desbloqueado · {date}

# triviaAchievementFirstCorrectTitle
source: First correct answer
es: Primer acierto

# triviaAchievementFirstCorrectDescription
source: Answer your first trivia question correctly.
es: Responde correctamente tu primera pregunta.

# triviaAchievementStreakThreeTitle
source: Streak x3
es: Racha x3

# triviaAchievementStreakThreeDescription
source: Chain three correct answers in a row.
es: Encadena tres respuestas correctas seguidas.

# triviaAchievementStreakFiveTitle
source: Living legend
es: Leyenda viviente

# triviaAchievementStreakFiveDescription
source: Reach five correct answers in a row.
es: Llega a cinco respuestas correctas seguidas.

# triviaAchievementTenQuestionsTitle
source: Trainer endurance
es: Aguante de entrenador

# triviaAchievementTenQuestionsDescription
source: Play ten questions in a single session.
es: Juega diez preguntas en una sesión.

# triviaAchievementScoreHunterTitle
source: Point hunter
es: Cazador de puntos

# triviaAchievementScoreHunterDescription
source: Reach 500 points in a single session.
es: Alcanza 500 puntos en una misma sesión.

# triviaFactSkittyTitle
source: Skitty can pair with Wailord
es: Skitty puede criar con Wailord

# triviaFactSkittyDescription
source: Egg groups ignore size, so tiny Skitty and massive Wailord are compatible parents.
es: Los grupos huevo ignoran el tamaño, así que la diminuta Skitty y el enorme Wailord son compatibles.

# triviaFactDittoTitle
source: Ditto mirrors Mew's stats
es: Ditto refleja las estadísticas de Mew

# triviaFactDittoDescription
source: Both share identical base stats and weight in early games, inspiring fan theories.
es: Ambos comparten estadísticas base y peso en los primeros juegos, alimentando teorías de fans.

# triviaFactPikachuTitle
source: Pikachu replaced Clefairy as mascot
es: Pikachu reemplazó a Clefairy como mascota

# triviaFactPikachuDescription
source: Clefairy was once planned as the star of the series before Pikachu's popularity took over.
es: Clefairy iba a ser la estrella de la serie antes de que la popularidad de Pikachu tomara el protagonismo.

# triviaQuestionPikachuPrompt
source: Who is this iconic Electric-type Pokémon?
es: ¿Quién es este Pokémon eléctrico icónico?

# triviaQuestionBulbasaurPrompt
source: Starts the Pokédex and carries a seed on its back.
es: Inicia la Pokédex y posee una semilla en su espalda.

# triviaQuestionCharizardPrompt
source: Fire-breathing dragon from Kanto.
es: Dragón que escupe fuego y pertenece a Kanto.

# triviaRemainingTimeLabel
source: Remaining time
es: Tiempo restante

# triviaStatsCorrectAnswers
source: Correct answers
es: Respuestas correctas

# triviaStatsScore
source: Score
es: Puntuación

# triviaStatsStreak
source: Streak
es: Racha

# triviaAnswerLabel
source: Your answer
es: Tu respuesta

# triviaCheckButtonLabel
source: Check
es: Comprobar

# triviaSkipTooltip
source: Skip
es: Saltar

# triviaRankingTooltip
source: View ranking
es: Ver ranking

# triviaAchievementsTooltip
source: View achievements
es: Ver logros

# triviaSaveSessionTooltip
source: Save session
es: Guardar sesión

# triviaTimeoutMessage
source: Time is up! The answer was {pokemon}.
es: ¡Tiempo agotado! La respuesta era {pokemon}.

# triviaCorrectMessage
source: Correct! It was {pokemon}.
es: ¡Correcto! Era {pokemon}.

# triviaIncorrectMessage
source: Incorrect answer. Try the next one.
es: Respuesta incorrecta. Inténtalo con el siguiente.

# triviaSaveUnavailableMessage
source: Couldn't access the ranking right now.
es: No se pudo acceder al ranking en este momento.

# triviaSaveNoQuestionsMessage
source: Play at least one question before saving.
es: Juega al menos una pregunta antes de guardar.

# triviaGuestPlayerName
source: Guest
es: Invitado

# triviaSessionSavedMessage
source: Session saved to the ranking
es: Sesión guardada en el ranking

# triviaAchievementUnlockedTitle
source: Achievement unlocked! 🎉
es: ¡Logro desbloqueado! 🎉

# homeSectionCardSemanticLabel
source: Open the {sectionName} section
es: Abrir la sección {sectionName}

# homeSectionCardSemanticHint
source: Double tap to navigate to {sectionName}
es: Toca dos veces para ir a {sectionName}

# detailInfoTypesTitle
source: Types
es: Tipos

# detailInfoTypesFallback
source: No type information available.
es: Sin información de tipos disponible.

# detailInfoBasicDataTitle
source: Basic data
es: Datos básicos

# detailCharacteristicHeight
source: Height
es: Altura

# detailInfoHeightLabel
source: Height
es: Altura

# detailCharacteristicWeight
source: Weight
es: Peso

# detailInfoWeightLabel
source: Weight
es: Peso

# detailInfoViewOnMap
source: View on map
es: Ver en mapa

# detailCharacteristicCategory
source: Category
es: Categoría

# detailCharacteristicNoCategory
source: No category
es: Sin categoría

# detailCharacteristicCatchRate
source: Catch rate
es: Ratio de captura

# detailCharacteristicBaseExperience
source: Base experience
es: Experiencia base

# detailInfoCharacteristicsTitle
source: Characteristics
es: Características

# detailInfoAbilitiesTitle
source: Abilities
es: Habilidades

# detailInfoAbilitiesFallback
source: No ability information available.
es: Sin información de habilidades disponible.

# detailInfoMainAbilityFallback
source: No main ability available.
es: Sin habilidad principal disponible.

# detailStatsTitle
source: Stats
es: Estadísticas

# detailStatsFallback
source: No stat information available.
es: Sin información de estadísticas disponible.

# detailMatchupsWeaknessesTitle
source: Weaknesses
es: Debilidades

# detailMatchupsResistancesTitle
source: Resistances & immunities
es: Resistencias e inmunidades

# detailEvolutionChainTitle
source: Evolution chain
es: Cadena evolutiva

# detailNoWeaknessInfo
source: No weakness information available.
es: No hay información de debilidades disponible.

# detailWeaknessLegendQuadruple
source: Double weakness: damage taken is multiplied by four.
es: Doble debilidad: el daño recibido se multiplica por cuatro.

# detailWeaknessLegendDouble
source: Classic weakness: super effective attacks.
es: Debilidad clásica: ataques súper efectivos.

# detailWeaknessLegendModerate
source: Moderate advantage: slightly increased damage.
es: Ventaja moderada: daño ligeramente incrementado.

# detailWeaknessToggleShow
source: Show weaknesses
es: Ver debilidades

# detailWeaknessToggleHide
source: Hide weaknesses
es: Ocultar debilidades

# homeNotificationsSemanticLabel
source: Notifications
es: Notificaciones

# homeNotificationsSemanticHint
source: Opens notifications and alerts
es: Abre tus notificaciones y alertas

# homeStoreSemanticLabel
source: Shop
es: Tienda

# homeStoreSemanticHint
source: Opens the in-app shop
es: Abre la tienda de la app

# homeSettingsSemanticLabel
source: Settings
es: Ajustes

# homeSettingsSemanticHint
source: Opens app settings
es: Abre la configuración de la app

# homePlaceholderMessage
source: The {sectionName} section will be available soon.
es: La sección de {sectionName} estará disponible pronto.

# abilitiesDefaultTitle
source: Abilities
es: Habilidades

# abilitiesSearchHint
source: Search ability…
es: Buscar habilidad…

# abilitiesErrorMessage
source: We couldn’t load the abilities.
es: No se pudieron cargar las habilidades.

# commonRetry
source: Retry
es: Reintentar

# abilitiesEmptySearch
source: We couldn’t find abilities that match your search.
es: No encontramos habilidades que coincidan con tu búsqueda.

# abilitiesEmptyGeneral
source: No abilities are available right now.
es: No hay habilidades disponibles en este momento.

# abilitiesNoDescription
source: No description available.
es: Sin descripción disponible.

# abilitiesNoShortDescription
source: No short description available.
es: Sin descripción breve disponible.

# abilitiesFullDescriptionTitle
source: Full description
es: Descripción completa

# abilitiesFullDescriptionFallback
source: No description is available in this language.
es: Sin descripción disponible en este idioma.

# abilitiesPokemonSectionTitle
source: Pokémon with this ability
es: Pokémon que la poseen

# abilitiesPokemonEmpty
source: We couldn’t find Pokémon associated with this ability.
es: No encontramos Pokémon asociados a esta habilidad.

# abilitiesPokemonErrorTitle
source: We couldn’t load the associated Pokémon.
es: No pudimos cargar los Pokémon asociados.

# abilitiesPokemonErrorDescription
source: Try again to see which Pokémon have this ability.
es: Intenta nuevamente para ver qué Pokémon cuentan con esta habilidad.

# pokedexSortNumberLabel
source: Number
es: Número

# pokedexSortNameLabel
source: Name
es: Nombre

# pokedexSortHeightLabel
source: Height
es: Altura

# pokedexSortWeightLabel
source: Weight
es: Peso

# abilityCardSemanticLabel
source: Open ability {abilityName}
es: Abrir la habilidad {abilityName}

# abilityCardSemanticHint
source: Double tap to see details for {abilityName}
es: Toca dos veces para ver detalles de {abilityName}

# pokedexCardSemanticLabel
source: Open {pokemonName} details
es: Abrir detalles de {pokemonName}

# pokedexCardSemanticHint
source: Double tap to view {pokemonName} in the Pokédex
es: Toca dos veces para ver a {pokemonName} en la Pokédex

# pokedexSearchHint
source: Search by name or number
es: Buscar por nombre o número

# pokedexFiltersTooltip
source: Filters
es: Filtros

# pokedexOfflineNoCache
source: No connection and no cached data available.
es: Sin conexión y sin datos guardados localmente.

# pokedexOfflineBanner
source: Offline mode active. Showing cached data.
es: Modo offline activo. Mostrando datos guardados localmente.

# pokedexConnectionRestored
source: Connection restored.
es: Conexión restablecida.

# pokedexLoadError
source: We couldn’t load the Pokédex. Try again.
es: No se pudo cargar la Pokédex. Intenta nuevamente.

# pokedexOfflineFiltersLimited
source: Offline mode active. Some filters may be limited.
es: Modo offline activo. Algunos filtros pueden ser limitados.

# pokedexShowingCountSimple
source: Showing {visible} Pokémon.
es: Mostrando {visible} Pokémon.

# pokedexShowingCountWithTotal
source: Showing {visible} of {total} Pokémon.
es: Mostrando {visible} de {total} Pokémon.

# pokedexActiveFilters
source: {count, plural, one {{count} active filter} other {{count} active filters}}
es: {count, plural, one {{count} filtro activo} other {{count} filtros activos}}

# pokedexSortDirectionAscending
source: ascending
es: ascendente

# pokedexSortDirectionDescending
source: descending
es: descendente

# pokedexFilterSummarySearch
source: Search: {query}
es: Búsqueda: {query}

# pokedexFilterSummaryType
source: Type: {value}
es: Tipo: {value}

# pokedexFilterSummaryGeneration
source: Generation: {value}
es: Generación: {value}

# pokedexFilterSummaryRegion
source: Region: {value}
es: Región: {value}

# pokedexFilterSummaryShape
source: Form: {value}
es: Forma: {value}

# pokedexFilterSummarySort
source: Sort: {value}
es: Orden: {value}

# pokedexNoResults
source: No Pokémon match the current filters.
es: No se encontraron Pokémon para los filtros actuales.

# pokedexFiltersTitle
source: Filters
es: Filtros

# pokedexFiltersCloseTooltip
source: Close
es: Cerrar

# pokedexFiltersCancel
source: Cancel
es: Cancelar

# pokedexFiltersApply
source: Apply
es: Aplicar

# pokedexFilterSectionTypes
source: Types
es: Tipos

# pokedexFilterSectionGenerations
source: Generations
es: Generaciones

# pokedexFilterSectionRegions
source: Regions
es: Regiones

# pokedexFilterSectionShapes
source: Shapes
es: Formas

# pokedexFilterEmptyTypes
source: No types available right now.
es: No hay tipos disponibles por ahora.

# pokedexFilterEmptyGenerations
source: No generations available right now.
es: No hay generaciones disponibles por ahora.

# pokedexFilterEmptyRegions
source: No regions available right now.
es: No hay regiones disponibles por ahora.

# pokedexFilterEmptyShapes
source: No shapes available right now.
es: No hay formas disponibles por ahora.

# pokedexFiltersClear
source: Clear
es: Limpiar

# commonCancel
source: Cancel
es: Cancelar

# commonApply
source: Apply
es: Aplicar

# detailOfflineModeSnack
source: Offline mode active. Showing locally saved data.
es: Modo offline activo. Mostrando datos guardados localmente.

# detailConnectionRestored
source: Connection restored.
es: Conexión restablecida.

# detailOfflineBanner
source: Offline mode active. Some advanced data may not be available.
es: Modo offline activo. Algunos datos avanzados pueden no estar disponibles.

# detailFallbackTitle
source: Pokémon details
es: Detalles del Pokémon

# detailTabInformation
source: Information
es: Información

# detailTabStatistics
source: Statistics
es: Estadísticas

# detailTabMatchups
source: Matchups
es: Enfrentamientos

# detailTabEvolutions
source: Evolutions
es: Evoluciones

# detailTabMoves
source: Moves
es: Movimientos

# detailMovesTitle
source: Moves
es: Movimientos

# detailMovesFilterSheetTitle
source: Filter moves
es: Filtrar movimientos

# detailMovesFilterMethodTitle
source: Learning method
es: Método de aprendizaje

# detailMovesFilterMethodAll
source: All methods
es: Todos los métodos

# detailMovesFilterMethodUnknown
source: Unknown
es: Desconocido

# detailMovesFilterButtonLabel
source: Filters
es: Filtros

# detailMovesFilterVersionTitle
source: Game version
es: Versión del juego

# detailMovesFilterVersionLabel
source: Version
es: Versión

# detailMovesFilterAllVersions
source: All versions
es: Todas las versiones

# detailMovesFilterOnlyWithLevel
source: Only moves with level
es: Solo movimientos con nivel

# detailMovesResetButtonLabel
source: Reset filters
es: Restablecer filtros

# detailMovesCountText
source: Showing {visibleMoves} of {totalMoves} moves
es: Mostrando {visibleMoves} de {totalMoves} movimientos

# detailMovesCountSemanticLabel
source: Visible moves counter
es: Contador de movimientos mostrados

# detailNoDataFound
source: We couldn't find information for this Pokémon.
es: No se encontró información para este Pokémon.

# detailOfflineShortMessage
source: Offline mode: showing saved information.
es: Modo offline: mostrando información guardada.

# detailOfflineLongMessage
source: Detailed information isn't available without a connection. Try again when you're back online.
es: La información detallada no está disponible sin conexión. Intenta nuevamente cuando recuperes internet.

# detailFavoriteRemoveTooltip
source: Remove from favorites
es: Quitar de favoritos

# detailFavoriteAddTooltip
source: Add to favorites
es: Agregar a favoritos

# detailHiddenAbilityLabel
source: Hidden ability
es: Habilidad oculta

# detailMainAbilityLabel
source: Main ability
es: Habilidad principal

# detailLoadErrorDescription
source: We couldn't load the Pokémon details. Check your connection or try again.
es: No se pudo obtener los datos del Pokémon. Verifica tu conexión o intenta de nuevo.

# pokedexSortSheetTitle
source: Sort by
es: Ordenar por

# pokedexSortCriteriaLabel
source: Criterion
es: Criterio

# pokedexSortDirectionLabel
source: Direction
es: Dirección

# pokedexSortAscendingLabel
source: Ascending
es: Ascendente

# pokedexSortDescendingLabel
source: Descending
es: Descendente

# favoritesRemoveAction
source: Remove from favorites
es: Quitar de favoritos

# favoritesAddAction
source: Add to favorites
es: Agregar a favoritos
